<?
$g_product_type = array(
	'1' => '跟团游',
	'2' => '自由行',  
	'3' => '签证', 
	'4' => '门票', 
	'5' => '酒店', 
	'6' => '邮轮',
	'7' => '当地游',
	'8' => '酒店套餐',
);

$g_product_type_url = array(
	'1' => 'gentuan',
	'2' => 'ziyouxing',  
	'3' => 'qianzheng', 
	'4' => 'menpiao', 
	'5' => 'jiudian', 
	'6' => 'youlun', 
);

$g_product_type_id = array(
	'gentuan' => '1',
	'ziyouxing' => '2',  
	'qianzheng' => '3', 
	'menpiao' => '4', 
	'jiudian' => '5', 
	'youlun' => '6', 
); 

$g_product_ad = array(
	'1' => 'GT',
	'2' => 'ZYX',  
	'3' => 'QZ', 
	'4' => 'MP', 
	'5' => 'JD', 
	'6' => 'YL', 
);


$g_order_state = array(
	'1'	=> '待付款',
	'2'	=> '已付款',
	'3'	=> '已确认',
	'4'	=> '已完成', 
	'5'	=> '已取消',
);


$g_score_order_state = array(
	'1'	=> '待完成',
	'2'	=> '已完成', 
	'3'	=> '已取消',
);
 
 
$g_product_type_key = array(
	'youxue'	=> '1',
	'peixun'	=> '2',
	'shijian'	=> '3', 
	'beijing'	=> '4',
); 

$g_product_zone = array(
	'1' => '周边游',
	'2' => '国内游',
	'3' => '出境游',
);

$g_product_zone_key = array(
	'zhoubian'	=> '1',
	'guonei'	=> '2',
	'chujing'	=> '3',
);

$g_product_road = array(
	'1' => '飞机',
	'2' => '火车',
	'3' => '汽车',
	'4' => '轮船',
	'5' => '动车',
	'6' => '高铁',
	'7' => '游船',
);

$g_product_tag = array(
	'1' => '亲子游',
	'2' => '休闲度假',
	'3' => '户外游',
	'4' => '小周末',
	'5' => '漂流',
	'6' => '暑假旅游',
	'7' => '海岛游',
	'8' => '古镇',
	'9' => '红色旅游',
	'10' => '摄影',
	'11' => '自驾游',
	'12' => '乡村游',
	'13' => '采摘',
	'14' => '特种旅游',
	'15' => '健康养生',
	'16' => '邮轮',
	'17' => '泡温泉', 
);


$g_product_money = array(
	'1' => '500元以下',
	'2' => '500元-999元',
	'3' => '5000元-9999元',
	'4' => '10000元-19999元',
	'5' => '20000元-29999元',
	'6' => '30000元-39999元',
	'7' => '40000元-49999元',
	'8' => '49999元以上',
); 

$g_product_money_filter = array(
	'1' => ' AND ###<3000',
	'2' => ' AND ###>=3000 AND ###<=4999',
	'3' => ' AND ###>=5000 AND ###<=9999',
	'4' => ' AND ###>=10000 AND ###<=19999',
	'5' => ' AND ###>=20000 AND ###<=29999',
	'6' => ' AND ###>=30000 AND ###<=39999',
	'7' => ' AND ###>=40000 AND ###<=49999', 
	'8' => ' AND ###>49999',
); 

$g_product_day = array(
	'1' => '1日游',
	'2' => '2日游',
	'3' => '3日游',
	'4' => '4日游',
	'5' => '5-7日游',
	'6' => '8-10日游',
	'7' => '10-12日游', 
	'8' => '12日游及以上',
);

$g_product_day_filter = array(
	'1' => ' AND ###=1',
	'2' => ' AND ###=2',
	'3' => ' AND ###=3',
	'4' => ' AND ###=4',
	'5' => ' AND ###>=5 AND ###<=7',
	'6' => ' AND ###>=8 AND ###<=10',
	'7' => ' AND ###>=11 AND ###<=12', 
	'8' => ' AND ###>12',
);

$g_gateway = array(
	'default'	=> '线下支付',
	'alipay'	=> '支付宝',
	'tenpay'	=> '财付通',
	'chinapay'	=> '中国银联', 
	'alipaywap'	=> '支付宝(WAP端)',
	'wxpay'		=> '微信支付',
); 

$g_product_package = array(
	'1' => '推荐',
	'2' => '超值',
	'3' => '纯玩',
	'4' => '豪华'
);  

$g_comment_level = array(
	'A'	=> '好评',
	'B'	=> '中评',
	'C'	=> '差评' 
);

$g_visa_type = array(
	'1'	=> '个人旅游签证',
	'2'	=> '商务签证',
	'3'	=> '探亲访友签证' 
);



$g_ship_line = array(
	'1' => '日韩',
	'2' => '美洲',
	'3' => '东南亚',
	'4' => '三峡',
	'5' => '环球',
	'6' => '港澳',
	'7' => '西沙',
	'8' => '台湾',
	'9' => '地中海',
	'10' => '波罗的海',
	'11' => '挪威峡湾',
	'12' => '英国爱尔兰连线',
	'13' => '阿拉斯加',
	'14' => '加拿大新英格兰连线',
	'15' => '加勒比海',
	'16' => '墨西哥巴拿马运河连线',
	'17' => '南美', 
	'18' => '南极', 
	'19' => '北极', 
);


$g_ship_port = array(
	'1' => '上海',
	'2' => '三亚',
	'3' => '海口',
	'4' => '香港',
	'5' => '天津',
	'6' => '宜昌',
	'7' => '重庆',
	'8' => '厦门',
	'9' => '舟山',
	'10' => '青岛',
	'11' => '烟台',
	'12' => '武汉',
	'13' => '广州',
	'14' => '南沙',
	'15' => '大连',
	'16' => '温州',
);

$g_ship_brand = array(
	'1' => '歌诗达邮轮',
	'2' => '公主邮轮',
	'3' => '皇家加勒比游轮',
	'4' => '地中海邮轮',
	'5' => '丽星邮轮',
	'6' => '诺维真邮轮',
	'7' => '长海游轮',
	'8' => '总统游轮',
	'9' => '世纪游轮',
	'10' => '美国维多利亚游轮',
	'11' => '黄金游轮',
	'12' => '华夏神女游轮',
	'13' => '中华泰山号',
	'14' => 'GADVENTURES',
	'15' => '天海邮轮公司',
	'16' => '北部湾之星',
	'17' => '长江探索号',
	'18' => '皇后邮轮',
	'19' => '希腊赛洛斯邮轮',
	'20' => 'Premicon AG股份公司',
	'21' => '精钻邮轮',
);
?>  